<template>
  <div class="container">
    <h4>سوالات متداول</h4>
    <div v-for="q in questions" :key="q.id" class="item">
      <div class="row-item" @click="select(q.id)">
        <p>{{ q.title }}</p>
        <font-awesome-icon :icon="['fas', 'user-secret']" />
      </div>
      <p v-show="q.id === selectedID">{{ q.des }}</p>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      selectedID: -1,
      questions: [
        {
          id: 1,
          title: "باسلام کجاست؟",
          des:
            "باسلام بستر کسب‌و‌کارهای کوچک است. اینجا سازندگان اصیل محصولات غیرکارخانه‌ای از شهرها و روستاهای مختلف بی‌واسطه می‌فروشند؛ بیشتر دیده می‌شوند و مشتریان وفادار خود را می‌یابند.در باسلام خریداران با فروشندگان گفت‌وگو می‌کنند و امتیازها، دیدگاه‌ها و تجربه‌های دیگران را می‌بینند. هزینه‌ای که می‌پردازند، زمانی به حساب فروشندگان می‌رود که از محصول دریافتی راضی باشند.",
        },
        {
          id: 2,
          title: "11/11 چه روز مهمی‌ست؟",
          des:
            "باسلام بستر کسب‌و‌کارهای کوچک است. اینجا سازندگان اصیل محصولات غیرکارخانه‌ای از شهرها و روستاهای مختلف بی‌واسطه می‌فروشند؛ بیشتر دیده می‌شوند و مشتریان وفادار خود را می‌یابند.در باسلام خریداران با فروشندگان گفت‌وگو می‌کنند و امتیازها، دیدگاه‌ها و تجربه‌های دیگران را می‌بینند. هزینه‌ای که می‌پردازند، زمانی به حساب فروشندگان می‌رود که از محصول دریافتی راضی باشند.",
        },
        {
          id: 3,
          title: "اگر خرید کردم و مشکل داشت باید چه کاری انجام دهم؟",
          des:
            "باسلام بستر کسب‌و‌کارهای کوچک است. اینجا سازندگان اصیل محصولات غیرکارخانه‌ای از شهرها و روستاهای مختلف بی‌واسطه می‌فروشند؛ بیشتر دیده می‌شوند و مشتریان وفادار خود را می‌یابند.در باسلام خریداران با فروشندگان گفت‌وگو می‌کنند و امتیازها، دیدگاه‌ها و تجربه‌های دیگران را می‌بینند. هزینه‌ای که می‌پردازند، زمانی به حساب فروشندگان می‌رود که از محصول دریافتی راضی باشند.",
        },
        {
          id: 4,
          title: "اگر خرید کردم و مشکل داشت باید چه کاری انجام دهم؟",
          des:
            "باسلام بستر کسب‌و‌کارهای کوچک است. اینجا سازندگان اصیل محصولات غیرکارخانه‌ای از شهرها و روستاهای مختلف بی‌واسطه می‌فروشند؛ بیشتر دیده می‌شوند و مشتریان وفادار خود را می‌یابند.در باسلام خریداران با فروشندگان گفت‌وگو می‌کنند و امتیازها، دیدگاه‌ها و تجربه‌های دیگران را می‌بینند. هزینه‌ای که می‌پردازند، زمانی به حساب فروشندگان می‌رود که از محصول دریافتی راضی باشند.",
        },
      ],
    };
  },

  methods: {
    select: function (id) {
      this.selectedID = id === this.selectedID ? -1 : id;
    },
  },
};
</script>

<style scoped>
.container {
  display: flex;
  flex-direction: column;
  margin-top: 6rem;
  justify-content: center;
  align-items: center;
}
h4 {
  color: #000;
  font-size: 2.5rem;
  text-align: center;
}

.item {
  width: 800px;
  background-color: #fff;
  border-radius: 1rem;
  padding: 0rem 1rem;
  margin: 0.5rem 0rem;
  display: flex;
  flex-direction: column;
}
.row-item {
  display: flex;
  width: 100%;
  flex-direction: row;
  justify-content: space-between;
  align-items: center;
  cursor: pointer;
}
</style>
